In [59]:
import pandas as pd
import numpy as np

In [60]:
train = pd.read_csv("train.csv",delimiter=",")
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [61]:
train.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [62]:
train.isna().sum()
#remove cabin coz of high NA

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [63]:
del train["Cabin"]
del train["Name"]
del train["Fare"]
del train["Ticket"]
del train["SibSp"]
del train["Parch"]
train.head()

   Pclass     Sex   Age Embarked  Survived
0       2  female  29.0        S         1
1       3    male   NaN        S         0
2       2    male  39.0        S         0
3       3  female  29.0        S         0
4       3    male  25.0        S         0

In [166]:
train[train.Parch == 5][train.Survived == 1].shape[0]

C:\Users\vibhu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

1

In [67]:
train[train.Embarked=="S"][train.Survived == 1].shape[0]
train[train.Embarked=="C"][train.Survived == 1].shape[0]

C:\Users\vibhu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.
C:\Users\vibhu\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

75

In [69]:
train[train.Embarked=="C"][train.Survived == 0].shape[0]

C:\Users\vibhu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

58

In [64]:
train.shape

(668, 5)

In [65]:
train.Embarked.isna().sum()

1

In [66]:
def getNum(str):
    if(str == 'male'):
        return 1
    else:
        return 0

In [67]:
train["Gender"] = train.Sex.apply(getNum)
del train["Sex"]
train.head()

   Pclass   Age Embarked  Survived  Gender
0       2  29.0        S         1       0
1       3   NaN        S         0       1
2       2  39.0        S         0       1
3       3  29.0        S         0       0
4       3  25.0        S         0       1

In [68]:
meanSurvived = train[train.Survived == 1].Age.mean()
meanSurvived

28.138157894736842

In [69]:
train["Age"] = np.where(pd.isnull(train.Age) &  train["Survived"] == 1,meanSurvived,train.Age)

In [70]:
train.isna().sum()
meanNotSurv = train[train.Survived == 0].Age.mean()
meanNotSurv

30.857142857142858

In [71]:
train["Age"].fillna(meanNotSurv,inplace = True)

In [72]:
train.isna().sum()

Pclass      0
Age         0
Embarked    1
Survived    0
Gender      0
dtype: int64

In [73]:
train.dropna(inplace = True)
train.head()

   Pclass        Age Embarked  Survived  Gender
0       2  29.000000        S         1       0
1       3  30.857143        S         0       1
2       2  39.000000        S         0       1
3       3  29.000000        S         0       0
4       3  25.000000        S         0       1

In [74]:
def getEmb(str):
    if(str == 'S'):
        return 1
    elif(str == 'Q'):
        return 2
    else:
        return 3
    
train["embarked"] = train.Embarked.apply(getEmb)

In [18]:
del train["Embarked"]
train.head()

   Pclass        Age  SibSp  Parch  Survived  Gender  embarked
0       2  29.000000      1      0         1       0         1
1       3  30.857143      0      0         0       1         1
2       2  39.000000      0      0         0       1         1
3       3  29.000000      0      4         0       0         1
4       3  25.000000      0      0         0       1         1

In [75]:
train = train[['Pclass','Age','Gender','embarked','Survived']]
train.head()

   Pclass        Age  Gender  embarked  Survived
0       2  29.000000       0         1         1
1       3  30.857143       1         1         0
2       2  39.000000       1         1         0
3       3  29.000000       0         1         0
4       3  25.000000       1         1         0

In [76]:
train.to_csv("train_final.csv",header=False,index=False)

In [77]:
test = pd.read_csv("test.csv",delimiter=",")
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [78]:
del test["Cabin"]
del test["Name"]
del test["Fare"]
del test["Ticket"]
del test["SibSp"]
del test["Parch"]
test.head()

   Pclass     Sex   Age Embarked
0       2    male   8.0        S
1       1  female  49.0        S
2       3    male   NaN        Q
3       2  female  24.0        S
4       1    male  36.0        S

In [79]:
test["embarked"] = test.Embarked.apply(getEmb)
del test["Embarked"]
test.head()

   Pclass     Sex   Age  embarked
0       2    male   8.0         1
1       1  female  49.0         1
2       3    male   NaN         2
3       2  female  24.0         1
4       1    male  36.0         1

In [80]:
test["Gender"] = test.Sex.apply(getNum)
del test["Sex"]
test.head()

   Pclass   Age  embarked  Gender
0       2   8.0         1       1
1       1  49.0         1       0
2       3   NaN         2       1
3       2  24.0         1       0
4       1  36.0         1       1

In [81]:
test.isna().sum()

Pclass       0
Age         45
embarked     0
Gender       0
dtype: int64

In [82]:
meanSurvived = train[train.Survived == 1].Age.mean()
meanSurvived

28.101359976433603

In [83]:
meanNotSurv = train[train.Survived == 0].Age.mean()
meanNotSurv

30.857142857142893

In [84]:
meanAge = test.Age.mean()
meanAge

29.694775280898877

In [85]:
#test["Age"] = np.where(pd.isnull(train.Age) &  train["Survived"] == 1,meanSurvived,test.Age)
test["Age"].fillna(meanAge,inplace = True)

In [87]:
test = test[['Pclass','Age','Gender','embarked']]
test.head()

   Pclass        Age  Gender  embarked
0       2   8.000000       1         1
1       1  49.000000       0         1
2       3  29.694775       1         2
3       2  24.000000       0         1
4       1  36.000000       1         1

In [46]:
test["Age"].fillna(meanNotSurv,inplace = True)
test.isna().sum()

C:\Users\vibhu\Anaconda3\lib\site-packages\pandas\core\generic.py:5434: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

Pclass      0
Age         0
SibSp       0
Parch       0
Gender      0
embarked    0
dtype: int64

In [88]:
test.head()
test.to_csv("test_final.csv",index=False,header=False)